; domain
(define (domain tankyard)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types tank)
  (:predicates
    (idle ?x - tank)
  )

    (:functions
        (level ?c - tank);; - int  ;; The value shown in counter ?c
        (flowrate ?c - tank);;
        (capacity);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action fill
         :parameters (?c - tank)
         :precondition (and (<= (+ (level ?c) (flowrate ?c)) (capacity)))
         :effect (and (increase (level ?c) (flowrate ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action drain
         :parameters (?c - tank)
         :precondition (and (>= (- (level ?c) (flowrate ?c)) 0))
         :effect (and (decrease (level ?c) (flowrate ?c)))
    )

    (:action open_valve
         :parameters (?c - tank)
         :precondition (and (<= (+ (flowrate ?c) 1) 10))
         :effect (and (increase (flowrate ?c) 1))
    )

    (:action close_valve
         :parameters (?c - tank)
         :precondition (and (>= (flowrate ?c) 1))
         :effect (and (decrease (flowrate ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_5_100)
  (:domain tankyard)
  (:objects
    tank0 tank1 tank2 tank3 tank4 - tank
  )
  (:init
    (= (level tank0) 12)
  (= (level tank1) 49)
  (= (level tank2) 93)
  (= (level tank3) 23)
  (= (level tank4) 79)

        (= (flowrate tank0) 0)
  (= (flowrate tank1) 0)
  (= (flowrate tank2) 0)
  (= (flowrate tank3) 0)
  (= (flowrate tank4) 0)

    (= (capacity) 100)
  )
  (:goal
    (and
      (<= (+ (level tank0) 1) (level tank1))
  (<= (+ (level tank1) 1) (level tank2))
  (<= (+ (level tank2) 1) (level tank3))
  (<= (+ (level tank3) 1) (level tank4))
    )
  )
)

; plan
1. (open_valve tank3)
   changed: (flowrate tank3) from 0 to 1
   goals met: 3 of 4
2. (open_valve tank3)
   changed: (flowrate tank3) from 1 to 2
   goals met: 3 of 4
3. (open_valve tank3)
   changed: (flowrate tank3) from 2 to 3
   goals met: 3 of 4
4. (open_valve tank3)
   changed: (flowrate tank3) from 3 to 4
   goals met: 3 of 4
5. (open_valve tank3)
   changed: (flowrate tank3) from 4 to 5
   goals met: 3 of 4
6. (open_valve tank3)
   changed: (flowrate tank3) from 5 to 6
   goals met: 3 of 4
7. (open_valve tank3)
   changed: (flowrate tank3) from 6 to 7
   goals met: 3 of 4
8. (open_valve tank3)
   changed: (flowrate tank3) from 7 to 8
   goals met: 3 of 4
9. (open_valve tank3)
   changed: (flowrate tank3) from 8 to 9
   goals met: 3 of 4
10. (open_valve tank3)
   changed: (flowrate tank3) from 9 to 10
   goals met: 3 of 4
11. (fill tank3)
   changed: (level tank3) from 23 to 33
   goals met: 3 of 4
12. (fill tank3)
   changed: (level tank3) from 33 to 43
   goals met: 3 of 4
13. (fill tank3)
   changed: (level tank3) from 43 to 53
   goals met: 3 of 4
14. (fill tank3)
   changed: (level tank3) from 53 to 63
   goals met: 3 of 4
15. (fill tank3)
   changed: (level tank3) from 63 to 73
   goals met: 3 of 4
16. (open_valve tank2)
   changed: (flowrate tank2) from 0 to 1
   goals met: 3 of 4
17. (fill tank3)
   changed: (level tank3) from 73 to 83
   goals met: 2 of 4
18. (fill tank3)
   changed: (level tank3) from 83 to 93
   goals met: 2 of 4
19. (open_valve tank4)
   changed: (flowrate tank4) from 0 to 1
   goals met: 2 of 4
20. (open_valve tank4)
   changed: (flowrate tank4) from 1 to 2
   goals met: 2 of 4
21. (open_valve tank4)
   changed: (flowrate tank4) from 2 to 3
   goals met: 2 of 4
22. (fill tank4)
   changed: (level tank4) from 79 to 82
   goals met: 2 of 4
23. (drain tank2)
   changed: (level tank2) from 93 to 92
   goals met: 3 of 4
24. (fill tank4)
   changed: (level tank4) from 82 to 85
   goals met: 3 of 4
25. (fill tank4)
   changed: (level tank4) from 85 to 88
   goals met: 3 of 4
26. (fill tank4)
   changed: (level tank4) from 88 to 91
   goals met: 3 of 4
27. (fill tank4)
   changed: (level tank4) from 91 to 94
   goals met: 4 of 4
